---
title:  "pandas 데이타프레임 생성 -- 기본"
# categories:
#   - Blog
tags: [python, pandas]

# toc: true
# toc_sticky: true
# toc_label: "페이지 목차"
---

In [12]:
import pandas as pd

df1 = pd.DataFrame([[3,1,8],[23,12,34]])
df1

    0   1   2
0   3   1   8
1  23  12  34

In [13]:
type(df1)

pandas.core.frame.DataFrame

In [15]:
df1 = pd.DataFrame([[3,1,8],[23,12,34]], columns=["Price", "age", "value"])
df1

   Price  age  value
0      3    1      8
1     23   12     34

In [16]:
df1 = pd.DataFrame([[3,1,8],[23,12,34]], columns=["Price", "age", "value"], index=["First", "Second"])
df1

        Price  age  value
First       3    1      8
Second     23   12     34

In [24]:
df1.mean()
type(df1.mean())
df1.mean()

Price    13.0
age       6.5
value    21.0
dtype: float64

In [17]:
df2 = pd.DataFrame([{"Name":"John"},{"Name":"Jack"}])
df2

   Name
0  John
1  Jack

In [18]:
df2 = pd.DataFrame([{"Name":"John","Surname":"Cho"},{"Name":"Jack"}])
df2

   Name Surname
0  John     Cho
1  Jack     NaN